{
    "FindingName": "Service Principals Found on Tenant with Certificate Credentials",
    "Description": "Service principals within the Tenant can be abused by attackers to impersonate legitimate applications and services with all permissions to the associated application. Service principals that leverage certificate credentials generally bypass MFA and Conditional Access Policies, and may allow attackers to authenticate as the application and perform any actions the application is capable of executing without triggering alerts. With sufficient access and privileges attackers may create new service principals or obtain or add credentials to existing service principals in the environment.",
    "Remediation": "Remove unapproved applications and service principals and review OAuth permission grants. Soteria recommends Organizations to audit application and service principal credentials regularly to ensure all credentials are valid and expected. Tenants licensed for Advanced Hunting (see Licensing Requirements in the reference links below) may use the KQL query linked in the references below to query for events and create a custom detection rule based on the query.",
    "DefaultValue": "Not Applicable",
    "ExpectedValue": "None",
    "Impact": "Critical",
    "RiskRating": "Review Required",
    "AffectedObjects": "",
    "Service": "AzureAD",
    "PowerShell": "",
    "References": [
        {
            "Url": "https://www.secureworks.com/research/abusing-azure-application-credentials-to-attack-supply-chains",
            "Text": "ABUSING AZURE APPLICATION CREDENTIALS TO ATTACK SUPPLY CHAINS"
        },
        {
            "Url": "https://www.inversecos.com/2021/10/how-to-backdoor-azure-applications-and.html",
            "Text": "How to Backdoor Azure Applications and Abuse Service Principals"
        },
        {
            "Url": "https://trustedsec.com/blog/creating-a-malicious-azure-ad-oauth2-application",
            "Text": "Creating a Malicious Azure AD OAuth2 Application"
        },
        {
            "Url": "https://learn.microsoft.com/en-us/microsoft-365/security/defender/prerequisites?view=o365-worldwide#licensing-requirements",
            "Text": "Microsoft Defender XDR prerequisites"
        },
        {
            "Url": "https://github.com/ThoughtContagion/Useful_KQL_Queries/blob/main/Add%20Credential%20to%20App%20or%20Service%20Principal.kql",
            "Text": "Add Credential to App or Service Principal.kql"
        }
    ]
}