{
    "FindingName": "Dangerous Application Permissions Found",
    "Description": "Applications were found to be registered or enabled in the tenant that contain dangerous permissions. The permissions, AppRoleAssignment.ReadWrite.All and RoleManagement.ReadWrite.Directory are the same permissions that were abused to breach Microsoft\u0027s environment to compromise email accounts belonging to senior leadership, legal, and cybersecurity teams between November 2023 and January 12, 2024. The permission RoleManagement.ReadWrite.Directory grants assigned applications and user accounts the ability to grant or modify any Directory Role assignment, allowing users or applications to assign Global Administrator roles to any targeted application, service principal, or user without a signed in user. Additionally, and far more concerning, the permission AppRoleAssignment.ReadWrite.All allows applications assigned this permission to elevate its own permissions, or that of any other application in the environment, by programmatically assigning and granting \u003ci\u003eany\u003c/i\u003e desired API permissions to itself or the targeted application without the need for administrator consent or a signed in user.",
    "Remediation": "Application permissions should be audited regularly and evaluated to determine if the permissions are valid and necessary for business needs. Applications that are not deemed to require these permissions should have unnecessary permissions revoked. If applications are deemed to be necessary and the permissions are required, application consent policies may be beneficial coupled with application assignment.",
    "DefaultValue": "None",
    "ExpectedValue": "None",
    "Impact": "Critical",
    "RiskRating": "",
    "AffectedObjects": "",
    "Service": "Tenant",
    "References": [
        {
            "Url": "https://posts.specterops.io/azure-privilege-escalation-via-azure-api-permissions-abuse-74aee1006f48",
            "Text": "Azure Privilege Escalation via Azure API Permissions Abuse"
        },
        {
            "Url": "https://learn.microsoft.com/en-us/entra/identity/enterprise-apps/manage-app-consent-policies?pivots=ms-graph",
            "Text": "Manage app consent policies"
        },
        {
            "Url": "https://learn.microsoft.com/en-us/entra/identity/enterprise-apps/assign-user-or-group-access-portal?pivots=portal",
            "Text": "Manage users and groups assignment to an application"
        },
        {
            "Url": "https://www.sec.gov/Archives/edgar/data/789019/000119312524011295/d708866dex991.htm",
            "Text": "SEC Filing Exhibit 99.1 - Microsoft Actions Following Attack by Nation State Actor Midnight Blizzard"
        },
        {
            "Url": "https://msrc.microsoft.com/blog/2024/01/microsoft-actions-following-attack-by-nation-state-actor-midnight-blizzard/",
            "Text": "Microsoft Actions Following Attack by Nation State Actor Midnight Blizzard"
        },
        {
            "Url": "https://learn.microsoft.com/en-us/graph/permissions-reference#approleassignmentreadwriteall",
            "Text": "AppRoleAssignment.ReadWrite.All"
        },
        {
            "Url": "https://learn.microsoft.com/en-us/graph/permissions-reference#rolemanagementreadwritedirectory",
            "Text": "RoleManagement.ReadWrite.Directory"
        }
    ]
}