{
    "FindingName": "Applications Registered to Tenant with Client Secret (Password) Credentials",
    "Description": "Registered applications within the Tenant can grant excessive OAuth permissions to the associated application and in turn grants those permissions to whomever is controlling the application. Registered Applications that leverage client secrets (application password credentials) generally bypass MFA and Conditional Access Policies, and may allow attackers to authenticate as the application and perform any actions the application is capable of executing without triggering alerts. With sufficient access and privileges attackers may obtain, brute force, or add credentials to existing applications in the environment.",
    "Remediation": "Remove unapproved applications and review OAuth permission grants. Soteria recommends disabling authentication via client secrets and leveraging certificate authentication instead. This method allows for greater control over the ability to authenticate and impersonate applications within the tenant. Organizations should audit application and service principal credentials regularly to ensure all credentials are valid and expected. Tenants licensed for Advanced Hunting (see Licensing Requirements in the reference links below) may use the KQL query linked in the references below to query for events and create a custom detection rule based on the query.",
    "DefaultValue": "Not Applicable",
    "ExpectedValue": "None",
    "Impact": "Critical",
    "RiskRating": "Review Required",
    "AffectedObjects": "",
    "Service": "AzureAD",
    "PowerShell": "",
    "References": [
        {
            "Url": "https://www.secureworks.com/research/abusing-azure-application-credentials-to-attack-supply-chains",
            "Text": "ABUSING AZURE APPLICATION CREDENTIALS TO ATTACK SUPPLY CHAINS"
        },
        {
            "Url": "https://www.inversecos.com/2021/10/how-to-backdoor-azure-applications-and.html",
            "Text": "How to Backdoor Azure Applications and Abuse Service Principals"
        },
        {
            "Url": "https://trustedsec.com/blog/creating-a-malicious-azure-ad-oauth2-application",
            "Text": "Creating a Malicious Azure AD OAuth2 Application"
        },
        {
            "Url": "https://learn.microsoft.com/en-us/microsoft-365/security/defender/prerequisites?view=o365-worldwide#licensing-requirements",
            "Text": "Microsoft Defender XDR prerequisites"
        },
        {
            "Url": "https://github.com/ThoughtContagion/Useful_KQL_Queries/blob/main/Add%20Credential%20to%20App%20or%20Service%20Principal.kql",
            "Text": "Add Credential to App or Service Principal.kql"
        }
    ]
}